routes/api.php

|
*/

Route::middleware('auth:api')->get('/user', function (Request $request) {
    return $request->user();
});
---
select * from `users`