routes/web.php

});

//Роут для извлечения всех пользователей
Route::get('/api/users', function (){
   return response(\App\Models\User::all(), 200);
})->middleware('auth');
---
select * from `users`